Plataforma/app/controllers/farms_controller.rb

SELECT "farms".* FROM "farms"
---
  def index
    @farms = Farm.all

INSERT INTO "farms" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Mi granjita"], ["created_at", "2018-04-21 16:23:08.498415"], ["updated_at", "2018-04-21 16:23:08.498415"], ["user_id", 2]]
---
  def create
    @farm = Farm.new(farm_params)

    respond_to do |format|
      if @farm.save

DELETE FROM "farms" WHERE "farms"."id" = ?  [["id", 5]]
---
  def destroy
    @farm.destroy

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_farm
      @farm = Farm.find(params[:id])