Plataforma/app/controllers/grooves_controller.rb

SELECT "grooves".* FROM "grooves" WHERE "grooves"."lot_id" = ?  [["lot_id", 4]]
---
  def index
    @grooves = Groove.where(lot_id: @lot.id)

INSERT INTO "grooves" ("quantity", "lot_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quantity", 12], ["lot_id", 1], ["created_at", "2018-04-23 20:02:32.266004"], ["updated_at", "2018-04-23 20:02:32.266004"]]
---
  def create
    @groofe = Groove.new(groofe_params)

    respond_to do |format|
      if @groofe.save

SELECT  "grooves".* FROM "grooves" WHERE "grooves"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_groofe
      @groofe = Groove.find(params[:id])

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_lot
      @lot = Lot.find(params[:lot_id])