Plataforma/app/controllers/grooves_controller.rb

  def index
    @grooves = Groove.all
---
SELECT "grooves".* FROM "grooves"