Plataforma/app/controllers/lots_controller.rb

INSERT INTO "lots" ("name", "location", "farm_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "si"], ["location", "colombia"], ["farm_id", 4], ["created_at", "2018-04-23 20:09:44.256898"], ["updated_at", "2018-04-23 20:09:44.256898"]]
---
  def create
    @lot = Lot.new(lot_params)

    respond_to do |format|
      if @lot.save

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_lot
      @lot = Lot.find(params[:id])

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_farm
      @farm = Farm.find(params[:farm_id])