Plataforma/app/controllers/lots_controller.rb

SELECT "lots".* FROM "lots"
---
  def index
    @lots = Lot.all