Plataforma/app/controllers/plague_reports_controller.rb

  def create
    @plague_report = @groove.plague_reports.create(plague_reports_params)
---
INSERT INTO "plague_reports" ("quantity", "reportDate", "description", "groove_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_plague_report
    @plague_report = PlagueReport.find(params[:id])
---
SELECT  "plague_reports".* FROM "plague_reports" WHERE "plague_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_groove
    @groove = Groove.find(params[:groofe_id])
---
SELECT  "grooves".* FROM "grooves" WHERE "grooves"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]