app/views/sensors/show.html.erb

      <tr>
        <td><%= value.value %></td>
---
SELECT "values".* FROM "values" WHERE "values"."sensor_id" = ?  [["sensor_id", 1]]