app/controllers/grooves_controller.rb

  def index
    @grooves = Groove.where(lot_id: @lot.id)
    grooves_n = @grooves.count

    data = []

    @grooves.each_with_index do |groove,i|
      if groove.plague_reports.present?
        sick_plants = groove.plague_reports.last.sick_plants.pluck(:location)
        (0..groove.quantity-1).each do |j|
---
SELECT "grooves".* FROM "grooves" WHERE "grooves"."lot_id" = ?  [["lot_id", 4]]
SELECT COUNT(*) FROM "grooves" WHERE "grooves"."lot_id" = ?  [["lot_id", 1]]
SELECT "plague_reports".* FROM "plague_reports" WHERE "plague_reports"."groove_id" = ?  [["groove_id", 1]]
SELECT "sick_plants"."location" FROM "sick_plants" WHERE "sick_plants"."plague_report_id" = ?  [["plague_report_id", 1]]

  def create
    @groofe = Groove.new(groofe_params)

    respond_to do |format|
      if @groofe.save
---
INSERT INTO "grooves" ("quantity", "lot_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quantity", 12], ["lot_id", 1], ["created_at", "2018-04-23 20:02:32.266004"], ["updated_at", "2018-04-23 20:02:32.266004"]]

    def set_groofe
      @groofe = Groove.find(params[:id])
---
SELECT  "grooves".* FROM "grooves" WHERE "grooves"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def set_lot
      @lot = Lot.find(params[:lot_id])
---
SELECT  "lots".* FROM "lots" WHERE "lots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]