app/controllers/nodes_controller.rb

  def create
    @node = Node.new(node_params)

    respond_to do |format|
      if @node.save
---
INSERT INTO "nodes" ("name", "created_at", "updated_at", "reference") VALUES (?, ?, ?, ?)  [["name", "dsds"], ["created_at", "2018-04-23 19:31:25.598233"], ["updated_at", "2018-04-23 19:31:25.598233"], ["reference", "ddsd"]]

    def set_node
      @node = Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]