app/controllers/plague_reports_controller.rb

  def index
    @plague_reports = @groove.plague_reports
    gon.surco_id = @groove.id
    gon.column_chart_data = @plague_reports.map { |a| [a.reportDate,a.quantity] }
---
SELECT "plague_reports".* FROM "plague_reports" WHERE "plague_reports"."groove_id" = ?  [["groove_id", 1]]