app/controllers/plague_reports_controller.rb

  def create
    # validar que location <= quantity
    if @plague_report.blank?
      p "No hay reporte en esa fecha, creando uno..."
      @plague_report = @groove.plague_reports.new(plague_reports_params)
      if @plague_report.save
        p "Operación realizada en plague reports"
        sick_plant = @plague_report.sick_plants.create(sick_plant_params)
---
INSERT INTO "plague_reports" ("quantity", "reportDate", "groove_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 0], ["reportDate", "2018-05-01"], ["groove_id", 8], ["created_at", "2018-05-01 14:04:01.987132"], ["updated_at", "2018-05-01 14:04:01.987132"]]
INSERT INTO "sick_plants" ("location", "plague_report_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", 1], ["plague_report_id", 2], ["created_at", "2018-05-17 00:59:48.517871"], ["updated_at", "2018-05-17 00:59:48.517871"]]

  def show
    p @sick_plants_l = @plague_report.sick_plants.pluck(:location).join(",")
    quantity = @groove.quantity

    # pie chart
    sick_plants_n = @plague_report.sick_plants.count
    healthy_plants_n = quantity-sick_plants_n
    gon.graphic_data = [
      ['Estado','Cantidad'],
      ['Sanas',healthy_plants_n],
      ['Enfermas',sick_plants_n]
    ]

    data = []
    (0..quantity-1).each_with_index do |i|
      data.push([i,0,0])
    end
    print data

    @plague_report.sick_plants.each do |plant|
---
SELECT "sick_plants"."location" FROM "sick_plants" WHERE "sick_plants"."plague_report_id" = ?  [["plague_report_id", 2]]
SELECT COUNT(*) FROM "sick_plants" WHERE "sick_plants"."plague_report_id" = ?  [["plague_report_id", 1]]
SELECT "sick_plants".* FROM "sick_plants" WHERE "sick_plants"."plague_report_id" = ?  [["plague_report_id", 1]]

  def find_reports
    dates = params[:dates]
    initial_date = params[:dates][:initial_date]
    final_date = params[:dates][:final_date]
    @plague_reports = @groove.plague_reports.where(reportDate: initial_date..final_date)
---
SELECT  "plague_reports".* FROM "plague_reports" WHERE "plague_reports"."groove_id" = ? AND ("plague_reports"."reportDate" BETWEEN ? AND ?) LIMIT ?  [["groove_id", 2], ["reportDate", "2018-05-20"], ["reportDate", "2018-05-20"], ["LIMIT", 1]]

  def set_user
    @user = Farm.find(params[:farm_id]).user
---
SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_plague_report
    @plague_report = PlagueReport.find(params[:id])
---
SELECT  "plague_reports".* FROM "plague_reports" WHERE "plague_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_groove
    @groove = Groove.find(params[:groofe_id])
---
SELECT  "grooves".* FROM "grooves" WHERE "grooves"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]