app/controllers/sensors_controller.rb

INSERT INTO "sensors" ("node_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["node_id", 1], ["created_at", "2018-04-28 18:58:39.315944"], ["updated_at", "2018-04-28 18:58:39.315944"]]
---
  def create

    @sensor = Sensor.new(sensor_params)
    respond_to do |format|
      if @sensor.save

SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def set_node
      @node = Node.find(params[:node_id])

SELECT  "sensors".* FROM "sensors" WHERE "sensors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_sensor
      @sensor = Sensor.find(params[:id])